In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, text, select
from sqlalchemy.orm import sessionmaker
import os
from dotenv import load_dotenv
from datetime import datetime

In [2]:
# Loading env variables
load_dotenv(dotenv_path='.\.env')

user = os.getenv('user')
password = os.getenv('password')
host = os.getenv('host')
port = os.getenv('port')
database = os.getenv('database')

In [3]:
# Creating Postgre SQL connection, passing user and password as arguments when running script
engine = create_engine(f'postgresql://{user}:{password}@{host}:{port}/{database}')

In [4]:
# Importing the 4 tables
df_sales = pd.read_sql_query("SELECT * FROM fact_sales", con=engine, parse_dates='transaction_date')
df_customers = pd.read_sql_query("SELECT * FROM dim_customers", con=engine)
df_products = pd.read_sql_query("SELECT * FROM dim_products", con=engine)
df_state_region = pd.read_sql_query("SELECT * FROM state_region_mapping", con=engine)

In [5]:
def df_details(df:pd.DataFrame) -> None:
    '''Function to provide main details on a DataFrame'''
    
    print(f'DataFrame Shape: {df.shape}\n')
        
    details_df = pd.DataFrame({'Data Type':df.dtypes, 
                               'Count': df.count(),
                               'Missing':df.isnull().sum(),
                               'Missing (%)':round((df.isnull().sum())/df.shape[0]*100,2),
                               'Mean':round(df.mean(numeric_only=True), 0),
                               'Min': round(df.min(numeric_only=True),0),
                               'Median': round(df.median(numeric_only=True), 0),
                               'Max': round(df.max(numeric_only=True),0),
                               '# Unique': df.nunique()},
                                index=df.columns)
    
    return details_df

### Sales Table

In [6]:
df_sales.head()

,transaction_date,customer_id,description,stock_code,invoice_no,quantity,sales,unit_price
0,2020-12-01 08:26:00,17850.0,Dog and Puppy Pads,85123A,536365.0,1,15.30,15.30
1,2020-12-01 08:34:00,13047.0,Pet Odor Eliminator,84879,536367.0,6,60.84,10.14
2,2020-12-01 08:34:00,13047.0,Rechargeable Pet Nail Grinder,22960,536368.0,1,25.50,25.50
3,2020-12-01 09:00:00,13748.0,Litter Slide Multi-Cat Scented Clumping Clay C...,22086,536371.0,14,214.20,15.30
4,2020-12-01 09:02:00,17850.0,Dog and Puppy Pads,85123A,536373.0,1,15.30,15.30

In [7]:
sales_details = df_details(df_sales)
sales_details

DataFrame Shape: (25065, 8)

,Data Type,Count,Missing,Missing (%),Mean,Min,Median,Max,# Unique
transaction_date,datetime64[ns],25065,0,0.00,NaN,NaN,NaN,NaN,11408
customer_id,float64,20649,4416,17.62,15289.0,12347.0,15152.0,18287.0,3146
description,object,25065,0,0.00,NaN,NaN,NaN,NaN,21
stock_code,object,25065,0,0.00,NaN,NaN,NaN,NaN,20
invoice_no,float64,24404,661,2.64,559953.0,536365.0,560224.0,581585.0,11427
quantity,int64,25065,0,0.00,3.0,-321.0,1.0,717.0,108
sales,float64,25065,0,0.00,61.0,-4911.0,30.0,38970.0,610
unit_price,float64,25065,0,0.00,29.0,0.0,24.0,3897.0,101

In [8]:
df_sales.transaction_date.min(), df_sales.transaction_date.max()

(Timestamp('2020-12-01 08:26:00'), Timestamp('2021-12-09 12:31:00'))

<b>SALES OBSERVATIONS:</b>

- transaction_date:  Range is from Dec 1, 2020 - Dec 9, 2021, so approximately over a year of sales.
- customer_id: Missing values and incorrect type
- description: 21 unique products?
- stock_code: 20 unique, should be the same number as description?
- invoice_no: Missing values and incorrect type
- Quantity min is -321 (assuming returns) and max is 717
- Sales min is -4,911 (assuming returns) and max is 38,970

### Customers Table

In [9]:
df_customers.head()

   customer_id    order_city order_postal order_state  latitude  longitude
0        18287  Rock Springs   82901-7321          WY   41.5869  -109.2048
1        18283       JACKSON   83001-9460          WY   43.4800  -110.7618
2        18282      Greybull        82426          WY   44.4892  -108.0562
3        18281      EVANSTON   82930-4706          WY   41.2680  -110.9633
4        18280      CHEYENNE   82001-7901          WY   41.1400  -104.8202

In [10]:
customers_details = df_details(df_customers)
customers_details

DataFrame Shape: (4372, 6)

,Data Type,Count,Missing,Missing (%),Mean,Min,Median,Max,# Unique
customer_id,int64,4372,0,0.00,15300.0,12346.0,15300.0,18287.0,4372
order_city,object,4372,0,0.00,NaN,NaN,NaN,NaN,2665
order_postal,object,4372,0,0.00,NaN,NaN,NaN,NaN,4253
order_state,object,4372,0,0.00,NaN,NaN,NaN,NaN,212
latitude,float64,4274,98,2.24,38.0,18.0,39.0,61.0,2407
longitude,float64,4274,98,2.24,-92.0,-158.0,-87.0,-66.0,2417

<b>CUSTOMERS OBSERVATIONS:</b>

- customer_id: There seems to be no duplicate values
    - This will be the KEY to join with sales table
- order_city: Need to check formatting/standardization
- order_postal: Need to check formatting/standardization
- order_state: Assuming this is US sales, why do we have 212 unique values? Probably a formatting issue
- latitude/longitude: Missing 98 values

### Products Table

In [11]:
df_products.head()

,stock_code,weight,landed_cost,shipping_cost_1000_mile,description,category
0,22423,40.0,35.0,20.0,Taste of the Wild High Prairie Grain-Free Dry ...,Food
1,85123A,2.0,6.0,5.0,Dog and Puppy Pads,Disposables
2,47566,6.0,18.0,12.0,"Memory Foam Pet Beds for Small, Medium, and La...",Disposables
3,85099B,2.0,5.0,4.0,Earth Rated Dog Poop Bags,Disposables
4,23084,2.0,6.0,6.0,Templation Soft Cat Treats,Pet Food

In [12]:
products_details = df_details(df_products)
products_details

DataFrame Shape: (20, 6)

,Data Type,Count,Missing,Missing (%),Mean,Min,Median,Max,# Unique
stock_code,object,20,0,0.0,NaN,NaN,NaN,NaN,20
weight,float64,20,0,0.0,5.0,0.0,2.0,40.0,9
landed_cost,float64,20,0,0.0,14.0,2.0,10.0,36.0,15
shipping_cost_1000_mile,float64,20,0,0.0,7.0,2.0,6.0,20.0,9
description,object,20,0,0.0,NaN,NaN,NaN,NaN,20
category,object,20,0,0.0,NaN,NaN,NaN,NaN,7

<b>PRODUCTS OBSERVATIONS:</b>

- stock_code: 20 unique values, same value as description
    - This will be the KEY to join with sales table
- weigth: 9 unique values ranging from 0 - 40, if whole numbers change to int
- landed_cost: 15 unique values ranging from 2 - 36, if whole numbers change to int
- shipping_cost_1000_mile: 9 unique values ranging from 2 - 20, if whole numbers change to int
    - Same unique values as weight, compare to see if they are related
- description: 20 unique values, inline with stock_code
- category: 7 unique values

### State Region table

In [13]:
df_state_region.head()

  order_state state region
0          AE    AE  Other
1          ak    AK  Other
2          AK    AK  Other
3          AL    AL   East
4     ALABAMA    AL   East

In [14]:
state_details = df_details(df_state_region)
state_details

DataFrame Shape: (192, 3)

,Data Type,Count,Missing,Missing (%),Mean,Min,Median,Max,# Unique
order_state,object,192,0,0.0,NaN,NaN,NaN,NaN,192
state,object,192,0,0.0,NaN,NaN,NaN,NaN,54
region,object,192,0,0.0,NaN,NaN,NaN,NaN,4

<b>STATE REGION OBSERVATIONS:</b>

- order_state: 192 unique values, need to check formatting/standardization
    - This will be the KEY to join with Customers table
- state: 54 unique values, need to check
- region: 4 unique values

Now that we have a basic understanding on the tables and their relationships, let's proceed to clean the data so we can join them later for EDA.

### DATA CLEANING - SALES

In [15]:
# How many records do we have where sales = 0, those don't provide value to our sales analysis
df_sales[df_sales.sales==0]['customer_id'].count()

498

In [16]:
# We'll drop those records
df_sales = df_sales[df_sales.sales != 0]

#### Sales - customer_id

In [17]:
# Checking if we have any of null customer ids with invoice that we could map
missing_customers = df_sales[df_sales.customer_id.isnull()].groupby('invoice_no')['customer_id'].count().to_list()
missing_customers[missing_customers != 0]

0

In [18]:
# Converting column to string
df_sales.customer_id = df_sales.customer_id.astype('str')

In [19]:
# If customer_id = 'nan' we'll do Guest_invoice_no
# If not we'll return the customer_id and remove the '.0'
df_sales.customer_id = df_sales.apply(lambda row: 'Guest_' + str(row['invoice_no'])[:6] \
                      if (row['customer_id'] == 'nan') else row['customer_id'][:5], axis=1)

In [20]:
# Checking that it worked
df_sales.sample(5)

,transaction_date,customer_id,description,stock_code,invoice_no,quantity,sales,unit_price
53,2020-12-01 12:36:00,16552,Taste of the Wild High Prairie Grain-Free Dry ...,22423,536502.0,1,76.50,76.50
183,2020-12-02 15:46:00,15574,Pet Odor Eliminator,84879,536796.0,1,10.14,10.14
284,2020-12-03 17:20:00,13081,Sheba Perfect Portions Pat Wet Cat Food,22197,537034.0,4,20.40,5.10
5928,2021-04-01 13:20:00,12949,Taste of the Wild High Prairie Grain-Free Dry ...,22423,548648.0,1,76.50,76.50
6976,2021-04-21 12:07:00,13505,Taste of the Wild High Prairie Grain-Free Dry ...,22423,550899.0,1,76.50,76.50

#### Sales - description

In [21]:
# Descriptions that are in SALES, but not in PRODUCT
for item in df_sales.description.unique():
    if item not in df_products.description.unique():
        print(item)

Sheba Perfect Portions Pat Wet Cat Food
Indoor Pet Camera (Wi-Fi)

In [22]:
df_sales[df_sales.description == 'Sheba Perfect Portions Pat Wet Cat Food']['description'].count()
# On PRODUCTS: Sheba Perfect Portions Paté Wet Cat Food

1413

In [23]:
df_sales[df_sales.description == 'Indoor Pet Camera (Wi-Fi)']['description'].count()
# On PRODUCTS: Indoor Pet Camera

52

In [24]:
# Descriptions that are in PRODUCTS, but not in SALES
for item in df_products.description.unique():
    if item not in df_sales.description.unique():
        print(item)

Sheba Perfect Portions Paté Wet Cat Food

In [25]:
df_sales[df_sales.description == 'Sheba Perfect Portions Paté Wet Cat Food']['description'].count()

0

In [26]:
df_sales[df_sales.description == 'Indoor Pet Camera']['description'].count()

413

NOTES: 
<br>There are 2 descriptions in SALES that are not in PRODUCTS

<br>Sales has:
<br>- 1413 sales with 'Sheba Perfect Portions Pat Wet Cat Food'
<br>- 0 sales with 'Sheba Perfect Portions Paté Wet Cat Food'

<br>Sales has:
<br>- 52 sales with 'Indoor Pet Camera (Wi-Fi)'
<br>- 413 sales with 'Indoor Pet Camera'

In [27]:
# Replacing descriptions with correct name from PRODUCTS
df_sales.loc[df_sales.description == 'Sheba Perfect Portions Pat Wet Cat Food','description'] = \
'Sheba Perfect Portions Paté Wet Cat Food'

In [28]:
# Checking that the description has been updated
df_sales[df_sales.description == 'Sheba Perfect Portions Paté Wet Cat Food']['description'].count()

1413

In [29]:
# Assuming PRODUCT should be the source of truth, we'll consolidate all sales to have description 'Indoor Pet Camera'
# instead of 'Indoor Pet Camera (Wi-Fi)'
df_sales.loc[df_sales.description == 'Indoor Pet Camera (Wi-Fi)','description'] = 'Indoor Pet Camera'

In [30]:
# Checking that the description has been updated (413 + 52) = 465
df_sales[df_sales.description == 'Indoor Pet Camera']['description'].count()

465

#### Sales - stock_code

In [31]:
len(df_sales.stock_code.unique()), len(df_products.stock_code.unique())

(20, 20)

In [32]:
# Checking if codes from SALES are not in PRODUCTS
for code in df_sales.stock_code.unique():
    if code not in df_products.stock_code.unique():
        print(code)

#### Sales - invoice_no:

In [33]:
# We have 164 records without invoice_no
df_sales[df_sales.invoice_no.isnull()]['customer_id'].count()

164

In [34]:
# Looking at some samples, they appear to have negative quantity and sales, we could assume these are returns
df_sales[df_sales.invoice_no.isnull()].sample(5)

,transaction_date,customer_id,description,stock_code,invoice_no,quantity,sales,unit_price
15605,2021-09-02 11:31:00,12471,Taste of the Wild High Prairie Grain-Free Dry ...,22423,NaN,-1,-65.70,65.70
24042,2021-12-01 08:44:00,13078,Sheba Perfect Portions Paté Wet Cat Food,22197,NaN,-2,-8.64,4.32
9309,2021-05-26 11:04:00,13089,Taste of the Wild High Prairie Grain-Free Dry ...,22423,NaN,-1,-65.70,65.70
17679,2021-09-29 12:49:00,14680,Earth Rated Dog Poop Bags,85099B,NaN,-16,-171.84,10.74
1844,2021-01-07 10:56:00,13680,ProBiotic Supplements for Dogs,79321,NaN,-12,-306.00,25.50

In [35]:
# Double checking that all of them are negative values, which seems to be the case
df_sales[df_sales.sales < 0]['customer_id'].count()

164

In [36]:
# Converting column to string
df_sales.invoice_no = df_sales.invoice_no.astype('str')

In [37]:
# If null fill with 'return'
# If not we'll return the invoice id and remove the '.0'
df_sales.invoice_no = df_sales.apply(lambda row: 'return' if (row['invoice_no'] == 'nan') else row['invoice_no'][:6], axis=1)

In [38]:
df_sales[df_sales.sales < 0].sample(2)

,transaction_date,customer_id,description,stock_code,invoice_no,quantity,sales,unit_price
12714,2021-07-18 14:24:00,16717,Dog and Puppy Pads,85123A,return,-1,-17.7,17.7
21586,2021-11-11 11:15:00,13881,Litter Slide Multi-Cat Scented Clumping Clay C...,22086,return,-6,-91.8,15.3

In [39]:
# Extracting year, month and day from transaction date
df_sales['year'] = df_sales.transaction_date.dt.year.astype('str')
df_sales['month'] = df_sales.transaction_date.dt.month_name()
df_sales['day'] = df_sales.transaction_date.dt.day.astype('str')
df_sales['day_of_week'] = df_sales.transaction_date.dt.day_name()

In [40]:
df_sales.sample(2)

,transaction_date,customer_id,description,stock_code,invoice_no,quantity,sales,unit_price,year,month,day,day_of_week
8088,2021-05-11 14:17:00,17664,Purina ONE SmartBlend Natural Adult Chicken 10lb,23298,552835,1,29.7,29.7,2021,May,11,Tuesday
8402,2021-05-16 09:57:00,13319,"Memory Foam Pet Beds for Small, Medium, and La...",47566,553220,2,59.4,29.7,2021,May,16,Sunday

In [41]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24505 entries, 0 to 25064
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_date  24505 non-null  datetime64[ns]
 1   customer_id       24505 non-null  object
 2   description       24505 non-null  object
 3   stock_code        24505 non-null  object
 4   invoice_no        24505 non-null  object
 5   quantity          24505 non-null  int64
 6   sales             24505 non-null  float64
 7   unit_price        24505 non-null  float64
 8   year              24505 non-null  object
 9   month             24505 non-null  object
 10  day               24505 non-null  object
 11  day_of_week       24505 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(8)
memory usage: 2.4+ MB

### DATA CLEANING - CUSTOMERS

#### Customers - order_city

In [42]:
# Number of cities
df_customers.order_city.nunique()

2665

In [43]:
# Formatting city as Title to standardize
df_customers.order_city = df_customers.order_city.apply(lambda city: city.title())

In [44]:
# Number dropped from 2665 to 2231
df_customers.order_city.nunique()

2231

In [45]:
df_customers.order_city.value_counts().head(10)

New York         58
Brooklyn         40
Chicago          36
Los Angeles      29
Houston          29
Miami            28
San Francisco    27
San Diego        25
Seattle          21
Dallas           21
Name: order_city, dtype: int64

#### Customers - order_postal

In [46]:
df_customers.order_postal.nunique()

4253

In [47]:
# At first glance they look normal, just different if they include the additional 4 digits
# These last 4 digits represent specific delivery routes within delivery areas.
# During analysis, we also noticed some zip codes with only 3 or 4 digits,
# Doing a bit of research we found out these are normal in some states and we need to pad those with 0s on the left
df_customers.order_postal.sample(10)

2033         64055
919          18067
130     99206-4437
760     57078-6745
4307    43832-9128
280     22180-4105
1856         27360
583     75225-4020
1413    11946-3217
835            623
Name: order_postal, dtype: object

In [48]:
# Different lenghts of postal codes
df_customers.order_postal.apply(lambda postal: len(postal)).unique()

array([10,  5,  4,  3], dtype=int64)

In [49]:
df_customers['order_postal_5_digits'] = df_customers.order_postal.apply(lambda postal: postal[:5] if (len(postal) >= 5) else postal.zfill(5) )

In [50]:
# Checking it only has 5 digits
df_customers.order_postal_5_digits.apply(lambda postal: len(postal)).unique()

array([5], dtype=int64)

In [51]:
# Leaving only one column
df_customers.drop(columns='order_postal', axis=1, inplace=True)
df_customers.rename(columns={'order_postal_5_digits':'order_postal'}, inplace=True)

In [52]:
df_customers.sample(5)

      customer_id   order_city order_state  latitude  longitude order_postal
1380        16392   Montgomery          NY   41.5276   -74.2368        12549
2289        15164  Catonsville          MD   39.2721   -76.7319        21228
338         17829      Fairfax          VA   38.8462   -77.3064        22032
880         17073      Reading          PA   40.3353   -75.9279        19606
2867        14383       Driggs          ID   43.7233  -111.1113        83422

#### Customers - order_state

In [53]:
# We are getting 212 states, but there should be only 50 states - we need to standardize
df_customers.order_state.nunique()

212

In [54]:
# Creating a list of US states abbreviations from https://usastatescode.com/state-array-json
states = ['AL','AK','AZ','AR','CA','CO','CT','DE','FL','GA','HI','ID','IL','IN','IA','KS','KY','LA','ME','MD','MA','MI','MN','MS','MO','MT','NE','NV','NH','NJ','NM','NY','NC','ND','OH','OK','OR','PA','RI','SC','SD','TN','TX','UT','VT','VA','WA','WV','WI','WY']

In [55]:
# We have a combination of full names, upper/lower case and abbreviations
df_customers.order_state.unique()[:40]

array(['WY', 'WV', 'Wisconsin', 'WI', 'wi', 'Wi', 'WEST VIRGINIA',
       'WASHINGTON', 'Washington', 'WA', 'wa', 'Wa', 'VT', 'VIRGINIA',
       'Virginia', 'VERMONT', 'Va.', 'VA', 'va', 'Va', 'UTAH', 'Utah',
       'UT', 'USVI', 'Tx', 'TX', 'tx', 'TN', 'tn', 'Texas', 'TEXAS', 'PA',
       'texas', 'Tennessee', 'TENNESSEE', 'South Carolina',
       'SOUTH CAROLINA', 'SD', 'SC', 'sc'], dtype=object)

In [56]:
# Lucky for us, the region table has most of these mappings
# We'll merge with the region table to get the values using left to make sure we keep all customers
df_customers = df_customers.merge(df_state_region, on='order_state', how='left')

In [57]:
# We get 54, but there are only 50 US states
# We see we also have some nan
df_customers.state.nunique(), df_customers.state.unique()

(54,
 array(['WY', 'WV', 'WI', 'WA', 'VT', 'VA', nan, 'UT', 'VI', 'TX', 'TN',
        'PA', 'SC', 'SD', 'RI', 'PR', 'OR', 'OK', 'OH', 'NY', 'NV', 'NC',
        'NM', 'NJ', 'NH', 'NE', 'ND', 'MT', 'MS', 'MO', 'MN', 'MI', 'ME',
        'MD', 'MA', 'LA', 'KY', 'KS', 'IA', 'IN', 'IL', 'ID', 'HI', 'GA',
        'FL', 'DC', 'DE', 'CT', 'CO', 'CA', 'AZ', 'AK', 'AR', 'AL', 'AE'],
       dtype=object))

In [58]:
# Which ones are not US states?
for state in df_customers.state.unique():
    if state not in states:
        print(state, end=' ')

nan VI PR DC AE

In [59]:
# PR is Puerto Rico, DC is Washington DC, so we'll look at the other 2
df_customers[df_customers.state.isin(['VI','AE'])]['order_state'].count()

8

In [60]:
# St.Croix is in the Virgin Islands (VI)
# APO is Army Post Office,  FPO is Fleet Post Office
df_customers[df_customers.state.isin(['VI','AE'])]

,customer_id,order_city,order_state,latitude,longitude,order_postal,state,region
405,17727,St.Croix,USVI,NaN,NaN,00851,VI,Other
4271,12471,Fpo,AE,NaN,NaN,09645,AE,Other
4272,12468,Fpo,AE,NaN,NaN,09618,AE,Other
4273,12465,Apo,AE,NaN,NaN,09021,AE,Other
4274,12464,Apo,AE,NaN,NaN,09811,AE,Other
4275,12463,Apo,AE,NaN,NaN,09354,AE,Other
4276,12462,Apo,AE,NaN,NaN,09330,AE,Other
4277,12461,Apo,AE,NaN,NaN,09250,AE,Other

In [61]:
# Checking the nan
df_customers.state.isnull().sum()

22

In [62]:
# Values for in the order_state column for the null states
df_customers[df_customers.state.isnull()]['order_state'].unique()

array(['VERMONT', 'ri', 'Ne', 'N.C.', 'mo', 'Mississippi', 'Md', 'Ks',
       'Kansas', 'IL.', 'Ia', 'georgia', 'ga', 'florida', 'Ct', 'Az.',
       'Az', 'ALASKA', 'Alabama', 'Al'], dtype=object)

In [63]:
# Creating dict with State and abbreviation mapping
states_dict = { "Alabama": "AL", "Alaska": "AK", "American Samoa": "AS", "Arizona": "AZ", "Arkansas": "AR", "California": "CA", "Colorado": "CO", "Connecticut": "CT", "Delaware": "DE", "District Of Columbia": "DC", "Federated States Of Micronesia": "FM", "Florida": "FL", "Georgia": "GA", "Guam": "GU", "Hawaii": "HI", "Idaho": "ID", "Illinois": "IL", "Indiana": "IN", "Iowa": "IA", "Kansas": "KS", "Kentucky": "KY", "Louisiana": "LA", "Maine": "ME", "Marshall Islands": "MH", "Maryland": "MD", "Massachusetts": "MA", "Michigan": "MI", "Minnesota": "MN", "Mississippi": "MS", "Missouri": "MO", "Montana": "MT", "Nebraska": "NE", "Nevada": "NV", "New Hampshire": "NH", "New Jersey": "NJ", "New Mexico": "NM", "New York": "NY", "North Carolina": "NC", "North Dakota": "ND", "Northern Mariana Islands": "MP", "Ohio": "OH", "Oklahoma": "OK", "Oregon": "OR", "Palau": "PW", "Pennsylvania": "PA", "Puerto Rico": "PR", "Rhode Island": "RI", "South Carolina": "SC", "South Dakota": "SD", "Tennessee": "TN", "Texas": "TX", "Utah": "UT", "Vermont": "VT", "Virgin Islands": "VI", "Virginia": "VA", "Washington": "WA", "West Virginia": "WV", "Wisconsin": "WI", "Wyoming": "WY" }

In [64]:
# If order_state is abbreviated, removing periods and doing uppercase
# If not mapping the state abbreviation from the our dictionary
df_customers.loc[df_customers.state.isnull(), 'state'] = df_customers[df_customers.state.isnull()]['order_state'].\
                                                                apply(lambda state: state.replace('.','').upper() \
                                                                  if len(state) < 5 else states_dict.get(state.title()))

In [65]:
# Checking that we don't have more nulls for state
df_customers.state.isnull().sum(), df_customers.state.nunique()

(0, 54)

In [66]:
# Dropping order_state column
df_customers = df_customers.drop(columns='order_state')

In [67]:
# Renaming to original column name
df_customers.rename(columns={'state':'order_state'}, inplace=True)

#### Customers - Latitude/Longitude

In [68]:
# 98 rows without latitude or longitude
df_customers[(df_customers.latitude.isnull()) | (df_customers.longitude.isnull())]['customer_id'].count()

98

In [69]:
# Creating reference to obtain lat/long from zipcode
zip_long_lat = pd.read_csv('zip_lat_long.txt', dtype={'zip_code':str,'latitude':float,'longitude':float}, skiprows=1,\
                          names=['zipcode','latitude','longitude'])

In [70]:
# Converting zipcode to object and padding with zeros
zip_long_lat.zipcode = zip_long_lat.zipcode.apply(lambda zipcode: str(zipcode).zfill(5))

In [71]:
zip_long_lat.head(2)

  zipcode   latitude  longitude
0   00601  18.180555 -66.749961
1   00602  18.361945 -67.175597

In [72]:
# Merging customers to obtain missing lat/long
df_customers = df_customers.merge(zip_long_lat, left_on='order_postal', right_on='zipcode', how='left',\
                                  suffixes=(None,'_zip'))
df_customers.head(2)

,customer_id,order_city,latitude,longitude,order_postal,order_state,region,zipcode,latitude_zip,longitude_zip
0,18287,Rock Springs,41.5869,-109.2048,82901,WY,West,82901,41.379272,-108.978176
1,18283,Jackson,43.4800,-110.7618,83001,WY,West,83001,43.394562,-110.629837

In [73]:
# Round lat/long to 4 decimals (as original) for consistency
df_customers.latitude = df_customers.latitude.apply(lambda lat: round(lat, 4))
df_customers.longitude = df_customers.longitude.apply(lambda long: round(long, 4))

In [74]:
# Copying values from our merge to the columns with missing values
df_customers.latitude.fillna(df_customers.latitude_zip, inplace=True)
df_customers.longitude.fillna(df_customers.longitude_zip, inplace=True)

In [75]:
# We still have some missing lat/long, but they seem to be FPO (Fleet Post Office - Navy), APO (Army Post Office)
df_customers[df_customers.latitude.isnull()]

,customer_id,order_city,latitude,longitude,order_postal,order_state,region,zipcode,latitude_zip,longitude_zip
4271,12471,Fpo,NaN,NaN,09645,AE,Other,NaN,NaN,NaN
4272,12468,Fpo,NaN,NaN,09618,AE,Other,NaN,NaN,NaN
4273,12465,Apo,NaN,NaN,09021,AE,Other,NaN,NaN,NaN
4274,12464,Apo,NaN,NaN,09811,AE,Other,NaN,NaN,NaN
4275,12463,Apo,NaN,NaN,09354,AE,Other,NaN,NaN,NaN
4276,12462,Apo,NaN,NaN,09330,AE,Other,NaN,NaN,NaN
4277,12461,Apo,NaN,NaN,09250,AE,Other,NaN,NaN,NaN

In [76]:
# Let's use a number just to indicate these are NaN, instead of leaving them as Nan
df_customers.loc[np.isnan(df_customers.latitude), 'latitude'] = 0.0
df_customers.loc[np.isnan(df_customers.longitude), 'longitude'] = 0.0

In [77]:
df_customers[df_customers.latitude.isnull()]

Empty DataFrame
Columns: [customer_id, order_city, latitude, longitude, order_postal, order_state, region, zipcode, latitude_zip, longitude_zip]
Index: []

In [78]:
# Cleaning up temporary columns we created
df_customers.drop(columns=['zipcode','latitude_zip','longitude_zip'], axis=1, inplace=True)

In [79]:
# We decided to keep region, but seems we have some missing values
df_customers[df_customers.region.isnull()]['customer_id'].count()

22

In [80]:
# Mapping missing values from the state_region table
df_customers.loc[df_customers.region.isnull(),'region'] = \
    df_customers.apply(lambda row: df_state_region.loc[df_state_region.state==row['order_state'], 'region'].unique()[0], axis=1)

In [81]:
# Cheking missing values
df_customers[df_customers.region.isnull()]['customer_id'].count()

0

In [82]:
# Changing customer_id type from int to str
df_customers.customer_id = df_customers.customer_id.astype('str')

In [83]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4372 entries, 0 to 4371
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   4372 non-null   object
 1   order_city    4372 non-null   object
 2   latitude      4372 non-null   float64
 3   longitude     4372 non-null   float64
 4   order_postal  4372 non-null   object
 5   order_state   4372 non-null   object
 6   region        4372 non-null   object
dtypes: float64(2), object(5)
memory usage: 402.3+ KB

### DATA CLEANING - PRODUCTS

#### Products - weight

In [84]:
# We see 9 unique weights, we'll leave them as float for now
df_products.weight.value_counts().sort_index()

0.5     3
1.0     6
2.0     5
5.0     1
6.0     1
7.0     1
10.0    1
15.0    1
40.0    1
Name: weight, dtype: int64

In [85]:
df_products.weight.min(), df_products.weight.max()

(0.5, 40.0)

#### Products - landed_cost

In [86]:
# We see 15 unique landed costs, we'll leave them as float for now
df_products.landed_cost.value_counts().sort_index()

2.5     1
4.0     2
5.0     1
6.0     3
8.0     2
9.0     1
12.0    1
15.0    1
18.0    2
20.0    1
22.0    1
23.0    1
30.0    1
35.0    1
36.0    1
Name: landed_cost, dtype: int64

In [87]:
df_products.landed_cost.min(), df_products.landed_cost.max()

(2.5, 36.0)

#### Products - shipping_cost_1000_mile

In [88]:
# We see 9 unique landed costs, we'll leave them as float for now
df_products.shipping_cost_1000_mile.value_counts().sort_index()

2.5     1
4.0     2
5.0     6
6.0     2
7.0     3
9.0     2
10.0    2
12.0    1
20.0    1
Name: shipping_cost_1000_mile, dtype: int64

In [89]:
df_products.shipping_cost_1000_mile.min(), df_products.shipping_cost_1000_mile.max()

(2.5, 20.0)

#### Products - category

In [90]:
# We noticed there is a misspelling on the category "Cleanig Supplies" 
# Also 1 product has "Pet Food" instead of "Food"
df_products.category.value_counts()

Food                6
Disposables         4
Grooming            4
Supplements         2
Electronics         2
Pet Food            1
Cleanig Supplies    1
Name: category, dtype: int64

In [91]:
# Fixing the typo
df_products.loc[df_products.category == 'Cleanig Supplies','category'] = 'Cleaning Supplies'

In [93]:
# Adjusting category
df_products.loc[df_products.category == 'Pet Food', 'category'] = 'Food'

In [94]:
df_products.category.unique()

array(['Food', 'Disposables', 'Cleaning Supplies', 'Supplements',
       'Electronics', 'Grooming'], dtype=object)

In [95]:
df_products.category.value_counts()

Food                 7
Disposables          4
Grooming             4
Supplements          2
Electronics          2
Cleaning Supplies    1
Name: category, dtype: int64

### Final check on data

In [96]:
final_sales_details = df_details(df_sales)
final_sales_details

DataFrame Shape: (24505, 12)

,Data Type,Count,Missing,Missing (%),Mean,Min,Median,Max,# Unique
transaction_date,datetime64[ns],24505,0,0.0,NaN,NaN,NaN,NaN,10951
customer_id,object,24505,0,0.0,NaN,NaN,NaN,NaN,4025
description,object,24505,0,0.0,NaN,NaN,NaN,NaN,20
stock_code,object,24505,0,0.0,NaN,NaN,NaN,NaN,20
invoice_no,object,24505,0,0.0,NaN,NaN,NaN,NaN,11376
quantity,int64,24505,0,0.0,3.0,-321.0,1.0,717.0,98
sales,float64,24505,0,0.0,62.0,-4911.0,30.0,38970.0,609
unit_price,float64,24505,0,0.0,29.0,4.0,22.0,3897.0,99
year,object,24505,0,0.0,NaN,NaN,NaN,NaN,2
month,object,24505,0,0.0,NaN,NaN,NaN,NaN,12
day,object,24505,0,0.0,NaN,NaN,NaN,NaN,31
day_of_week,object,24505,0,0.0,NaN,NaN,NaN,NaN,6

In [97]:
final_customers_details = df_details(df_customers)
final_customers_details

DataFrame Shape: (4372, 7)

,Data Type,Count,Missing,Missing (%),Mean,Min,Median,Max,# Unique
customer_id,object,4372,0,0.0,NaN,NaN,NaN,NaN,4372
order_city,object,4372,0,0.0,NaN,NaN,NaN,NaN,2231
latitude,float64,4372,0,0.0,38.0,0.0,39.0,61.0,2491
longitude,float64,4372,0,0.0,-92.0,-158.0,-87.0,0.0,2501
order_postal,object,4372,0,0.0,NaN,NaN,NaN,NaN,3429
order_state,object,4372,0,0.0,NaN,NaN,NaN,NaN,54
region,object,4372,0,0.0,NaN,NaN,NaN,NaN,4

In [98]:
final_products_details = df_details(df_products)
final_products_details

DataFrame Shape: (20, 6)

,Data Type,Count,Missing,Missing (%),Mean,Min,Median,Max,# Unique
stock_code,object,20,0,0.0,NaN,NaN,NaN,NaN,20
weight,float64,20,0,0.0,5.0,0.0,2.0,40.0,9
landed_cost,float64,20,0,0.0,14.0,2.0,10.0,36.0,15
shipping_cost_1000_mile,float64,20,0,0.0,7.0,2.0,6.0,20.0,9
description,object,20,0,0.0,NaN,NaN,NaN,NaN,20
category,object,20,0,0.0,NaN,NaN,NaN,NaN,6

### Exporting clean data

In [99]:
# Exporting to our local instance of Postgres
df_sales.to_sql('sales', con=engine, if_exists='replace', index=False)
df_products.to_sql('products', con=engine, if_exists='replace', index=False)
df_customers.to_sql('customers', con=engine, if_exists='replace', index=False)

372

In [100]:
# If we want to get the SQL statement template to create the schema directly in postgres or modify some data types
print(pd.io.sql.get_schema(df_sales, name='sales'))

CREATE TABLE "sales" (
"transaction_date" TIMESTAMP,
  "customer_id" TEXT,
  "description" TEXT,
  "stock_code" TEXT,
  "invoice_no" TEXT,
  "quantity" INTEGER,
  "sales" REAL,
  "unit_price" REAL,
  "year" TEXT,
  "month" TEXT,
  "day" TEXT,
  "day_of_week" TEXT
)